clear
close all
clc

x_gap_5 = [5	10	15	20	25	30	35	40	45	50];
y_gap_3 = [80.8066	77.0629	77.5081	75.345	73.2833	71.1599	68.9535	67.3119	70.4456	72.8142];

x = [32	33	34	35	36	37	38	39	40	41	42	43	44	45	46	47	48	49	50];
y = [70.3879	69.7831	69.2117	68.9535	68.4108	68.1956	67.835	67.5004	67.3119	67.8452	68.2455	68.9173	68.9271	70.4456	70.9341	71.166	71.4254	72.6632	72.8142];

figure(1);
subplot(1,2,1),plot(x_gap_5,y_gap_3,'r','LineWidth',1);grid on;
xlabel('间隔5秒-匀速减速到30km/h的时间(s)');
ylabel('总油耗(ml)');
legend('总油耗(ml)');

subplot(1,2,2),plot(x,y,'r','LineWidth',1);grid on;
xlabel('间隔1秒-32~50-匀速减速到30km/h的时间(s)');
ylabel('总油耗(ml)');
legend('总油耗(ml)');